{
    "7413409529892850949": {
        "name": "@nobudgetbabe_video_7413409529892850949",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7413409529892850949"
        },
        "original_content": "I can't bet the biggest financial regret that a lot of your parents have is not investing while they were young. And I get it, it is so easy to put something like this off for the future because you think, well this is a problem for the me of tomorrow, I'm not retiring for 20, 30, 40 years, why do I need to think about this right now? They figure, I don't have a lot of money now, maybe I'll have more money then. Without realizing that investing is quite literally how you turn small amounts of money into big amounts of money over time. When you're young you may not have a lot of money, but guess what you have a lot of? Time. And when you have a lot of time, that's when compound interest can come in and do its thing and make you rich while you sleep. And it hurts my heart because if we just educated people on how investing works, and the fact that it's not a nice to have, it's a must have, if you ever want to be able to stop working, that investing is not something the rich do, it's quite literally how you get rich. When I became a millionaire at 30 it wasn't because I saved a million dollars, it was because I grew a million dollars. And by not investing not only are you making your life hard, or you're gonna have to work longer, but there's a lot of children who are feeling this anxiety right here, where their parents don't have anything safe for retirement, and they know that that is going to fall onto them. Because even if people say, okay well my retirement plan is to die at my desk, maybe that's just not an option for you. Sometimes people get laid off after being loyal to a company for 30 years. Companies downsize, your skills become obsolete, or maybe heaven forbid something happens and you get sick and you are not actually able to work anymore. Investing is the only way that you will have financial safety, financial freedom, financial security in your life long term. So take this as your sign, even if it's $50 a month, start somewhere, start today. Maybe the best time to plant a tree was 20 years ago, but the second best time is right now."
    },
    "7413169283217247493": {
        "name": "@nobudgetbabe_video_7413169283217247493",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7413169283217247493"
        },
        "original_content": "To be a self-made millionaire, here are five money lessons that you need to know if you want to be rich. Your home isn't an investment, it's your shelter. Most people's homes are their best investment simply because they have never made an actual investment. It doesn't matter if your home has gone up in value because so have all the other homes around you. Unless you significantly downsize or move somewhere much cheaper, you're just living in your money. An investment pays you, you work to pay for your house, even when the mortgage is gone. The caveat to this is if you bought your home with wealth building in mind, like you plan to flip it or you are house hacking, yes, then you can make money off your house. Expensive weddings are correlated with shorter marriages. Recent studies showed that couples who spend more than $20,000 on their big day were 1.6 times more likely to divorce than couples who spend between 5,000 and $10,000. Number three, you will never retire if you don't invest. Pensions are a thing of the past for most people and we have been sold the lie that retirement is an age. It's not, it's simply a number in the bank. It's when your assets like stocks and real estate provide you with enough cashflow that you no longer have to trade your time for money. If you never hit this number, you will work forever. Number four, investing is actually really simple. Instead of looking for a needle in the haystack and trying to figure out which stock or which company is gonna be best, just buy the whole haystack. You can get something like an asset allocation fund. It's one click to buy this and it has everything you need. It's the same thing a financial advisor would have done for you for a fraction of the cost. I have a free investing masterclass on my website if you wanna learn more. Number five, kids are expensive. Not just in daycare costs and food, but in the amount of time that you'll miss from work caring for them is the penalty that has on your lifetime earnings."
    },
    "7413031439152762117": {
        "name": "@nobudgetbabe_video_7413031439152762117",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7413031439152762117"
        },
        "original_content": "I wanna know how much money you need to live your best life. So I actually have a $5 million net worth at 33 years old. This money will provide me with multiple six figures a year in passive income. And I made a video about how you can figure out your financial independence number or FU number. And I got this comment saying that she wants a million dollars a year to spend in her best life. I literally could not fathom spending that much money a year. I don't even know what I would buy at that point. After the first couple of years of spending a million dollars you know, buying houses, I don't know, are you buying like jets, vacations? Like white cars? Where do you keep putting all of this money? What do you keep buying and spending it on? I gotta know, tell me in the comments."
    },
    "7413006516116032773": {
        "name": "@nobudgetbabe_video_7413006516116032773",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7413006516116032773"
        },
        "original_content": "I blew up that last video so let's talk three more habits that will make you rich from a self-made millionaire And I hope this reaches the right person today because this could be the thing that changes everything for you I wanted this is gonna be controversial, but you need to start setting some small goals now your girl Loves a big goal. I became a self-made millionaire and published author in my 30s But if I woke up every day telling myself Nicole you just need to make a million dollars I would have been overwhelmed as shit instead I set small Realistic laddered goals that build on each other so I can avoid analysis paralysis For example if you want to save a $25,000 down payment on a home Maybe you break it down like this so first we have our down payment 25k. Oh, that's overwhelming, right? So we have our timeline for our goal two years. We're gonna break it down monthly That's going to be a thousand and forty one dollars month, but still feels like a lot instead Let's break that shit down daily that we need to get thirty four dollars and twenty five cents a day thirty five dollars feels a lot More manageable than $25,000 and when things feel easy they become easy number two you got to stop making your own mistakes It has a recovering perfectionist this speaks to me at someone else do the hard shit and then learn from them when I started selling Real estate I became a top broker in less than a year And it's because I had a mentor that taught me exactly what not to do instead of me taking the time energy and money to figure It out myself. He just gave me the roadmap to success number three You just need to GSD mode it the law of diminishing intent says the longer you wait to take action the less likely you are To do it GSD mode stands for get shit done How long have you been talking about saving money negotiating raise starting investing the longer you wait the less likely? It's gonna be that you do it and the harder It's gonna be to get done you're ready to enter your rich girl era check our link in bio for our free trainings."
    },
    "7412720587971333382": {
        "name": "@nobudgetbabe_video_7412720587971333382",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7412720587971333382"
        },
        "original_content": "They say she's gone too far this time Love made me, love made me crazy"
    },
    "7412632481272220933": {
        "name": "@nobudgetbabe_video_7412632481272220933",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7412632481272220933"
        },
        "original_content": "What do you mean when you say that you are living paycheck to paycheck? Because there are multiple categories of this. There are the people who are actually living in poverty, right? They are struggling financially because there is something outside of themselves preventing them from thriving economically. Then there are the people who say they are living paycheck to paycheck, but it's because they put themselves into that situation. On one hand, we have the people who inflate their lifestyle expenses. They inflate their fixed expenses, the things that they have to pay for every month. So even when they make a good salary, they're still living check to check because their fixed expenses are too high of a percentage of their income. If your fixed expenses, aka the things that you have to pay for every month, are over 50 to 60% of your net monthly income, they are too high and it's going to prevent you from being able to have the money available to save and invest or hit your other goals. And then we have the people who make a good salary, right? They have decent fixed expenses. They're around the 50 to 60% range or lower, but their discretionary spending is out of fucking control. And that's okay if that's you, it happens to the best of us. I have been there. The solution that works best for you is going to be fully dependent on your situation. What's the root cause for the reason why you are where you're at? Once you know the root cause, then you can start looking for the solutions to overcome that specifically. If you're living in poverty, it's not impossible to change, but it is damn hard. But if you're one of the other two situations that I talked about, that means that you are broke. That means that your decisions put you there. And that's actually a really beautiful place to be because that means if your decisions put you there, then your decisions can easily take you out. If you are just starting on this journey, I have a ton of free financial trainings available on my website under freebies to help you identify the problem child and start coming up with solutions to fix the situation. You've got this."
    },
    "7412421506774355205": {
        "name": "@nobudgetbabe_video_7412421506774355205",
        "source": {
            "name": "tiktok video",
            "drive_path": "/content/drive/MyDrive/tiktok_nobudgetbabe/@nobudgetbabe_video_7412421506774355205"
        },
        "original_content": "you are making half a million dollars a year and you feel like you don't have any money, that's a problem. Because as I said in this video, if you always spend all of your money, you will never have any money. You need to start giving your money the respect that it deserves. Why? Because right now you are working for a paycheck. That means you are trading your limited life, right? The life that you only get one of, we get 700,000 hours in a lifetime if we're lucky, and you're trading those hours for money. And it's just flying out of your life. You are not respecting that trade. And this is that hedonic treadmill, that hedonic adaptation, where you long for this new item. Maybe it's a luxury car, maybe it's a new watch. And then you get it, right? You get a momentary boost in your happiness. But before long, you are right back to that same plateau, that same level of happiness you were before. This thing, this item that you thought was going to change your life, only changed your life momentarily. And humans are wired for this. Each new level that you climb up, right? You make $50,000 a year, then you make 80,000, then you make 100, then you make 200, then you make a half a million dollars a year, and you keep increasing your lifestyle every time you start making more money. You quickly adapt to that new lifestyle, and it no longer feels like wealth or luxury. It feels like just everyday life. And then you start craving more and more and more. This is also what I mean when I say that you can be living paycheck to paycheck on any income. It is not about how much you make. There are pro athletes that go broke all of the time, lottery winners. You could have millions and millions of dollars and still not have enough money. More money will never solve your problems until you first understand the psychology and the mindset that got you to the situation you're in. You need to understand the opportunity costs, that trade-off costs, and respect that trade of your life for money. Value your life. You only get one. And with this income, you could own your life so quickly."
    }
}